tutorials/testcases/mixer_3d/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (-0.8 0.0 0.2)
    (0.8 0.0 0.2)
    (0.8 0.0 1.0)
    (-0.8 0.0 1.0)
    (-0.8 0.2 1.22464679915e-17)
    (0.8 0.2 1.22464679915e-17)
    (0.8 1.0 6.12323399574e-17)
    (-0.8 1.0 6.12323399574e-17)
    (-0.8 2.44929359829e-17 -0.2)
    (0.8 2.44929359829e-17 -0.2)
    (0.8 1.22464679915e-16 -1.0)
    (-0.8 1.22464679915e-16 -1.0)
    (-0.8 -0.2 -3.67394039744e-17)
    (0.8 -0.2 -3.67394039744e-17)
    (0.8 -1.0 -1.83697019872e-16)
    (-0.8 -1.0 -1.83697019872e-16)
    (-0.4 0.0 0.2)
    (-0.1 0.0 0.2)
    (0.1 0.0 0.2)
    (0.4 0.0 0.2)
    (-0.4 0.0 0.5)
    (-0.1 0.0 0.5)
    (0.1 0.0 0.5)
    (0.4 0.0 0.5)
    (-0.4 0.0 0.8)
    (-0.1 0.0 0.8)
    (0.1 0.0 0.8)
    (0.4 0.0 0.8)
    (-0.4 0.2 1.22464679915e-17)
    (-0.1 0.2 1.22464679915e-17)
    (0.1 0.2 1.22464679915e-17)
    (0.4 0.2 1.22464679915e-17)
    (-0.4 0.5 3.06161699787e-17)
    (-0.1 0.5 3.06161699787e-17)
    (0.1 0.5 3.06161699787e-17)
    (0.4 0.5 3.06161699787e-17)
    (-0.4 0.8 4.89858719659e-17)
    (-0.1 0.8 4.89858719659e-17)
    (0.1 0.8 4.89858719659e-17)
    (0.4 0.8 4.89858719659e-17)
    (-0.4 2.44929359829e-17 -0.2)
    (-0.1 2.44929359829e-17 -0.2)
    (0.1 2.44929359829e-17 -0.2)
    (0.4 2.44929359829e-17 -0.2)
    (-0.4 6.12323399574e-17 -0.5)
    (-0.1 6.12323399574e-17 -0.5)
    (0.1 6.12323399574e-17 -0.5)
    (0.4 6.12323399574e-17 -0.5)
    (-0.4 9.79717439318e-17 -0.8)
    (-0.1 9.79717439318e-17 -0.8)
    (0.1 9.79717439318e-17 -0.8)
    (0.4 9.79717439318e-17 -0.8)
    (-0.4 -0.2 -3.67394039744e-17)
    (-0.1 -0.2 -3.67394039744e-17)
    (0.1 -0.2 -3.67394039744e-17)
    (0.4 -0.2 -3.67394039744e-17)
    (-0.4 -0.5 -9.18485099361e-17)
    (-0.1 -0.5 -9.18485099361e-17)
    (0.1 -0.5 -9.18485099361e-17)
    (0.4 -0.5 -9.18485099361e-17)
    (-0.4 -0.8 -1.46957615898e-16)
    (-0.1 -0.8 -1.46957615898e-16)
    (0.1 -0.8 -1.46957615898e-16)
    (0.4 -0.8 -1.46957615898e-16)
);

blocks
(
    // block0
    hex (0 1 5 4 3 2 6 7) stator (48 38 24) simpleGrading (1 1 1)
    hex (4 5 9 8 7 6 10 11) stator (48 38 24) simpleGrading (1 1 1)
    hex (8 9 13 12 11 10 14 15) stator (48 38 24) simpleGrading (1 1 1)
    hex (12 13 1 0 15 14 2 3) stator (48 38 24) simpleGrading (1 1 1)
    hex (16 17 29 28 20 21 33 32) rotor (10 41 16) simpleGrading (1 1 1)
    hex (20 21 33 32 24 25 37 36) rotor (10 41 10) simpleGrading (1 1 1)
    hex (17 18 30 29 21 22 34 33) rotor0 (10 41 16) simpleGrading (1 1 1)
    hex (21 22 34 33 25 26 38 37) rotor (10 41 10) simpleGrading (1 1 1)
    hex (18 19 31 30 22 23 35 34) rotor (10 41 16) simpleGrading (1 1 1)
    hex (22 23 35 34 26 27 39 38) rotor (10 41 10) simpleGrading (1 1 1)
    hex (28 29 41 40 32 33 45 44) rotor (10 41 16) simpleGrading (1 1 1)
    hex (32 33 45 44 36 37 49 48) rotor (10 41 10) simpleGrading (1 1 1)
    hex (29 30 42 41 33 34 46 45) rotor1 (10 41 16) simpleGrading (1 1 1)
    hex (33 34 46 45 37 38 50 49) rotor (10 41 10) simpleGrading (1 1 1)
    hex (30 31 43 42 34 35 47 46) rotor (10 41 16) simpleGrading (1 1 1)
    hex (34 35 47 46 38 39 51 50) rotor (10 41 10) simpleGrading (1 1 1)
    hex (40 41 53 52 44 45 57 56) rotor (10 41 16) simpleGrading (1 1 1)
    hex (44 45 57 56 48 49 61 60) rotor (10 41 10) simpleGrading (1 1 1)
    hex (41 42 54 53 45 46 58 57) rotor2 (10 41 16) simpleGrading (1 1 1)
    hex (45 46 58 57 49 50 62 61) rotor (10 41 10) simpleGrading (1 1 1)
    hex (42 43 55 54 46 47 59 58) rotor (10 41 16) simpleGrading (1 1 1)
    hex (46 47 59 58 50 51 63 62) rotor (10 41 10) simpleGrading (1 1 1)
    hex (52 53 17 16 56 57 21 20) rotor (10 41 16) simpleGrading (1 1 1)
    hex (56 57 21 20 60 61 25 24) rotor (10 41 10) simpleGrading (1 1 1)
    hex (53 54 18 17 57 58 22 21) rotor3 (10 41 16) simpleGrading (1 1 1)
    hex (57 58 22 21 61 62 26 25) rotor (10 41 10) simpleGrading (1 1 1)
    hex (54 55 19 18 58 59 23 22) rotor (10 41 16) simpleGrading (1 1 1)
    hex (58 59 23 22 62 63 27 26) rotor (10 41 10) simpleGrading (1 1 1)
);

edges
(
    arc 0 4 (-0.8 0.141421356237 0.141421356237)
    arc 1 5 (0.8 0.141421356237 0.141421356237)
    arc 3 7 (-0.8 0.707106781187 0.707106781187)
    arc 2 6 (0.8 0.707106781187 0.707106781187)
    arc 4 8 (-0.8 0.141421356237 -0.141421356237)
    arc 5 9 (0.8 0.141421356237 -0.141421356237)
    arc 7 11 (-0.8 0.707106781187 -0.707106781187)
    arc 6 10 (0.8 0.707106781187 -0.707106781187)
    arc 8 12 (-0.8 -0.141421356237 -0.141421356237)
    arc 9 13 (0.8 -0.141421356237 -0.141421356237)
    arc 11 15 (-0.8 -0.707106781187 -0.707106781187)
    arc 10 14 (0.8 -0.707106781187 -0.707106781187)
    arc 12 0 (-0.8 -0.141421356237 0.141421356237)
    arc 13 1 (0.8 -0.141421356237 0.141421356237)
    arc 15 3 (-0.8 -0.707106781187 0.707106781187)
    arc 14 2 (0.8 -0.707106781187 0.707106781187)
    arc 16 28 (-0.4 0.141421356237 0.141421356237)
    arc 17 29 (-0.1 0.141421356237 0.141421356237)
    arc 18 30 (0.1 0.141421356237 0.141421356237)
    arc 19 31 (0.4 0.141421356237 0.141421356237)
    arc 20 32 (-0.4 0.353553390593 0.353553390593)
    arc 21 33 (-0.1 0.353553390593 0.353553390593)
    arc 22 34 (0.1 0.353553390593 0.353553390593)
    arc 23 35 (0.4 0.353553390593 0.353553390593)
    arc 24 36 (-0.4 0.565685424949 0.565685424949)
    arc 25 37 (-0.1 0.565685424949 0.565685424949)
    arc 26 38 (0.1 0.565685424949 0.565685424949)
    arc 27 39 (0.4 0.565685424949 0.565685424949)
    arc 28 40 (-0.4 0.141421356237 -0.141421356237)
    arc 29 41 (-0.1 0.141421356237 -0.141421356237)
    arc 30 42 (0.1 0.141421356237 -0.141421356237)
    arc 31 43 (0.4 0.141421356237 -0.141421356237)
    arc 32 44 (-0.4 0.353553390593 -0.353553390593)
    arc 33 45 (-0.1 0.353553390593 -0.353553390593)
    arc 34 46 (0.1 0.353553390593 -0.353553390593)
    arc 35 47 (0.4 0.353553390593 -0.353553390593)
    arc 36 48 (-0.4 0.565685424949 -0.565685424949)
    arc 37 49 (-0.1 0.565685424949 -0.565685424949)
    arc 38 50 (0.1 0.565685424949 -0.565685424949)
    arc 39 51 (0.4 0.565685424949 -0.565685424949)
    arc 40 52 (-0.4 -0.141421356237 -0.141421356237)
    arc 41 53 (-0.1 -0.141421356237 -0.141421356237)
    arc 42 54 (0.1 -0.141421356237 -0.141421356237)
    arc 43 55 (0.4 -0.141421356237 -0.141421356237)
    arc 44 56 (-0.4 -0.353553390593 -0.353553390593)
    arc 45 57 (-0.1 -0.353553390593 -0.353553390593)
    arc 46 58 (0.1 -0.353553390593 -0.353553390593)
    arc 47 59 (0.4 -0.353553390593 -0.353553390593)
    arc 48 60 (-0.4 -0.565685424949 -0.565685424949)
    arc 49 61 (-0.1 -0.565685424949 -0.565685424949)
    arc 50 62 (0.1 -0.565685424949 -0.565685424949)
    arc 51 63 (0.4 -0.565685424949 -0.565685424949)
    arc 52 16 (-0.4 -0.141421356237 0.141421356237)
    arc 53 17 (-0.1 -0.141421356237 0.141421356237)
    arc 54 18 (0.1 -0.141421356237 0.141421356237)
    arc 55 19 (0.4 -0.141421356237 0.141421356237)
    arc 56 20 (-0.4 -0.353553390593 0.353553390593)
    arc 57 21 (-0.1 -0.353553390593 0.353553390593)
    arc 58 22 (0.1 -0.353553390593 0.353553390593)
    arc 59 23 (0.4 -0.353553390593 0.353553390593)
    arc 60 24 (-0.4 -0.565685424949 0.565685424949)
    arc 61 25 (-0.1 -0.565685424949 0.565685424949)
    arc 62 26 (0.1 -0.565685424949 0.565685424949)
    arc 63 27 (0.4 -0.565685424949 0.565685424949)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (4 7 11 8)
            (8 11 15 12)
            (12 15 3 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 6 2 1)
            (9 10 6 5)
            (13 14 10 9)
            (1 2 14 13)
        );
    }
    fixedWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (3 2 6 7)
            (4 8 9 5)
            (7 6 10 11)
            (8 12 13 9)
            (11 10 14 15)
            (12 0 1 13)
            (15 14 2 3)
        );
    }
    nonRotatingWall
    {
        type wall;
        faces
        (
            (28 29 17 16)
            (30 31 19 18)
            (40 41 29 28)
            (42 43 31 30)
            (52 53 41 40)
            (54 55 43 42)
            (16 17 53 52)
            (18 19 55 54)
        );
    }
    rotatingWall
    {
        type wall;
        faces
        (
            (29 30 18 17)
            (41 42 30 29)
            (53 54 42 41)
            (17 18 54 53)
        );
    }
    inner
    {
        type bellerophon;
        donorZone stator;
        faces
        (
            (16 20 32 28)
            (31 35 23 19)
            (20 24 36 32)
            (35 39 27 23)
            (24 25 37 36)
            (25 26 38 37)
            (26 27 39 38)
            (28 32 44 40)
            (43 47 35 31)
            (32 36 48 44)
            (47 51 39 35)
            (36 37 49 48)
            (37 38 50 49)
            (38 39 51 50)
            (40 44 56 52)
            (55 59 47 43)
            (44 48 60 56)
            (59 63 51 47)
            (48 49 61 60)
            (49 50 62 61)
            (50 51 63 62)
            (52 56 20 16)
            (19 23 59 55)
            (56 60 24 20)
            (23 27 63 59)
            (60 61 25 24)
            (61 62 26 25)
            (62 63 27 26)
        );
    }
);

// ************************************************************************* //

