tutorials/testcases/mixer_3d/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
pointSync false;

patches
(
{
    name outer;
    patchInfo
    {
        type bellerophon;
        donorZone rotor;
    }
    constructFrom patches;
    patches (oldInternalFaces);
}
{
    name rotatingWall;
    patchInfo
    {
        type wall;
    }
    constructFrom patches;
    patches (rotatingWall baffleFaces_slave baffleFaces_master);
}
);

// ************************************************************************* //
